**Missing Value Analysis**

- MVA very important in Data analysis

- It is quiet natural data set has missing values

- There are so many technique are there:
    - Mean
    - Median 
    - Mode
    - bfill
    - ffill
    - pad
    - random values
    - You can compare column values and you can impute
    - KNN imputer

In [1]:
import pandas as pd
import numpy as np

In [33]:
dict1={'Names':['Ramesh','Suresh','Sathish', np.nan],
     'Ages':[30,31,np.nan,32],
     'City':[np.nan,'Hyd','Pune','Chennai']}
df1 = pd.DataFrame(dict1)
df1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

dict1={'Names':['Ramesh','Suresh','Sathish', np.nan],
     'Ages':[30,31,np.nan,32],
     'City':[np.nan,'Hyd','Pune','Chennai']}
df1 = pd.DataFrame(dict1)
df1

In [4]:
df1.isnull()

   Names   Ages   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [5]:
df1.isnull().sum()

Names    1
Ages     1
City     1
dtype: int64

In [6]:
dict2={'Names':['Ramesh','Suresh','Sathish', 'Null'],
     'Ages':[30,31,"Null",32],
     'City':['Null','Hyd','Pune','Chennai']}
df2 = pd.DataFrame(dict2)
df2

     Names  Ages     City
0   Ramesh    30     Null
1   Suresh    31      Hyd
2  Sathish  Null     Pune
3     Null    32  Chennai

In [10]:
dict3={'Names':['Ramesh','Suresh','Sathish', None],
     'Ages':[30,31,None,32],
     'City':[None,'Hyd','Pune','Chennai']}
df3 = pd.DataFrame(dict3)
df3

     Names  Ages     City
0   Ramesh  30.0     None
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3     None  32.0  Chennai

In [11]:
df3.isnull()

   Names   Ages   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [ ]:
value are not present, empty box is there ==== Null value

csv we dont have np.nan

In [13]:
df3.to_csv('df3.csv')

- np.nan

- None is working

- Some times when you read csv if you have missing values
  it shows as Null
    
- isnull()

$Method-1$

**Random fill**

In [15]:
df1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [16]:
df1.fillna(40,inplace=True)
df1

     Names  Ages     City
0   Ramesh  30.0       40
1   Suresh  31.0      Hyd
2  Sathish  40.0     Pune
3       40  32.0  Chennai

In [ ]:
df1.dtypes()

$Method-2$

**Fill the random values in specific column**

In [18]:
dict1={'Names':['Ramesh','Suresh','Sathish', np.nan],
     'Ages':[30,31,np.nan,32],
     'City':[np.nan,'Hyd','Pune','Chennai']}
df1 = pd.DataFrame(dict1)
df1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [21]:
df1["Ages"].fillna(40,inplace=True)
df1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  40.0     Pune
3      NaN  32.0  Chennai

$Method-3$`

  - Mean
  - Median
  - Mode

- Median does not affect by outliers

- Mean affect by outliers

- If you have a data is there
    
    - First check the outlier, by simple box plot
    
    - you can check with created outlier function
    
    - If you feel ther is outlier are there
    
    - Then fill missing values with Median

In [22]:
dict1={'Names':['Ramesh','Suresh','Sathish', np.nan],
     'Ages':[30,31,np.nan,32],
     'City':[np.nan,'Hyd','Pune','Chennai']}
df1 = pd.DataFrame(dict1)
df1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [23]:
age_mean = df1["Ages"].mean()
age_mean

31.0

In [24]:
age_mean = df1["Ages"].mean()
age_mean
df1["Ages"].fillna(age_mean,inplace=True)
df1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  31.0     Pune
3      NaN  32.0  Chennai

In [25]:
dict1={'Names':['Ramesh','Suresh','Sathish', np.nan],
     'Ages':[30,31,np.nan,32],
     'City':[np.nan,'Hyd','Pune','Chennai']}
df1 = pd.DataFrame(dict1)
df1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [28]:
age_median = df1["Ages"].median()
print("age_median = ",age_median)
df1["Ages"].fillna(age_median,inplace=True)
df1

age_median =  31.0

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  31.0     Pune
3      NaN  32.0  Chennai

In [29]:
dict1={'Names':['Ramesh','Suresh','Sathish', np.nan],
     'Ages':[30,31,np.nan,32],
     'City':[np.nan,'Hyd','Pune','Chennai']}
df1 = pd.DataFrame(dict1)
df1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [31]:
name_mode = df1["Names"].mode()
print("name_mode = ",name_mode)
df1["Names"].fillna(name_mode,inplace=True)
df1

name_mode =  0     Ramesh
1    Sathish
2     Suresh
Name: Names, dtype: object

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

**Method-4**
   - backfill
   - bfill
   - ffill
   - pad

In [34]:
dict1={'Names':['Ramesh','Suresh','Sathish', np.nan],
     'Ages':[30,31,np.nan,32],
     'City':[np.nan,'Hyd','Pune','Chennai']}
df1 = pd.DataFrame(dict1)
df1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [35]:
df1.fillna(method='pad') # By default axis = 0

# It is filling by previous value by Column reference
# For the column axis = 1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  31.0     Pune
3  Sathish  32.0  Chennai

In [39]:
dict1={'Names':['Ramesh','Suresh','Sathish', np.nan],
     'Ages':[30,31,np.nan,32],
     'City':[np.nan,'Hyd','Pune','Chennai']}
df1 = pd.DataFrame(dict1)
df1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [40]:
df1.fillna(method='pad',
       axis=0)

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  31.0     Pune
3  Sathish  32.0  Chennai

In [42]:
dict1={'Names':['Ramesh','Suresh','Sathish', np.nan],
     'Ages':[30,31,np.nan,32],
     'City':[np.nan,'Hyd','Pune','Chennai']}
df1 = pd.DataFrame(dict1)
df1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [43]:
df1.fillna(method='pad',
       axis=1)

     Names     Ages     City
0   Ramesh     30.0     30.0
1   Suresh     31.0      Hyd
2  Sathish  Sathish     Pune
3      NaN     32.0  Chennai

In [44]:
dict1={'Names':['Ramesh','Suresh','Sathish', np.nan],
     'Ages':[30,31,np.nan,32],
     'City':[np.nan,'Hyd','Pune','Chennai']}
df1 = pd.DataFrame(dict1)
df1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [45]:
df1.fillna(method='backfill')

     Names  Ages     City
0   Ramesh  30.0      Hyd
1   Suresh  31.0      Hyd
2  Sathish  32.0     Pune
3      NaN  32.0  Chennai

In [46]:
dict1={'Names':['Ramesh','Suresh','Sathish', np.nan],
     'Ages':[30,31,np.nan,32],
     'City':[np.nan,'Hyd','Pune','Chennai']}
df1 = pd.DataFrame(dict1)
df1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [47]:
df1.fillna(method='bfill')

     Names  Ages     City
0   Ramesh  30.0      Hyd
1   Suresh  31.0      Hyd
2  Sathish  32.0     Pune
3      NaN  32.0  Chennai

In [48]:
dict1={'Names':['Ramesh','Suresh','Sathish', np.nan],
     'Ages':[30,31,np.nan,32],
     'City':[np.nan,'Hyd','Pune','Chennai']}
df1 = pd.DataFrame(dict1)
df1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [50]:
df1.fillna(method="ffill")

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  31.0     Pune
3  Sathish  32.0  Chennai

In [51]:
dict1={'Names':['Ramesh','Suresh','Sathish', np.nan],
     'Ages':[30,31,np.nan,32],
     'City':[np.nan,'Hyd','Pune','Chennai']}
df1 = pd.DataFrame(dict1)
df1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [54]:
print("======== pad =======")
df1.fillna(method="pad")

print("======== pad =======")
df1.fillna(method="ffill")

print("======== backfill =======")
df1.fillna(method="backfill")

print("======== bfill =======")
df1.fillna(method="bfill")

======== pad =======
======== pad =======
======== backfill =======
======== bfill =======

     Names  Ages     City
0   Ramesh  30.0      Hyd
1   Suresh  31.0      Hyd
2  Sathish  32.0     Pune
3      NaN  32.0  Chennai

- pad and ffill both are same

- bfill and backfill both are same

**Categorical columns**

- Categorical colukn mainly does not have any meaning in dataframes

- If it is some text or sentence you can find the menaing of sentence

- For example Names column is there, Review column is there

- Because of only Name it self you can't judge the output

- But a Review can impact the output

- Generally if any naive names kind of column we can fill in any way

- But if some coulumn impacting output, Yes we need to fill those columns
  with as idea about how that column is related with other columns


    Reason                                  Chured
Competitor had better device review count    30
product dissatisfaction                      140
Network reliability                           50
Limited range of services                     60


Churned: reason (negative reason)
    
analysis

$Method-5$

**KNN imputer**

KNN = k - nearest Neighbour

- It is bases on ML model to find nearest solution based distance metrics

- Instead of taking all the values mean

- Why ca't we take neighbour mean of the observation

- Here first will choose neighbours

- It will calculate mean of those neighbours and fill with that value

**Package name**: Sklean.imputer

**Method name**: knnImputer

- You need to explore this:
    - Test with Numerical Column
    - Test with categorical + Numerical

In [55]:
30
31
32
nan ----> 33.5
35
36

(32+35)/2

33.5

NameError: name 'nan' is not defined

In [56]:
(32+35)/2

33.5

In [58]:
df1['Ages'].values

array([30., 31., nan, 32.])

In [60]:
df1.values

array([['Ramesh', 30.0, nan],
       ['Suresh', 31.0, 'Hyd'],
       ['Sathish', nan, 'Pune'],
       [nan, 32.0, 'Chennai']], dtype=object)